FKDD_COPY_DIFF_3_2026-02-13/Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Номенклатура</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о номенклатуре</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата создания записи о номенклатуре</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Вид платежа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияДопРасходов</Name>
					<Comment>Заполняется только для услуг и управляет распределением суммы по услуге в пределах документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДопРасходов</Name>
					<Comment>Заполняется для услуг. По этой статье происходит начисление расходов / доходов при поставке / отгрузке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>(в днях) из конфигурации Торговый Комплекс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки по умолчанию (для расчета цен)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаАвтокаталога</Name>
					<Comment>Индекс картинки номенклатуры в автокаталоге</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Comment>Счет учета НДС по реализации используется при выгрузке в бухгалтерию</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Обычно соответствует массе Брутто в основной единице измерения массы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>Соотвестует объему в основной единице измерения объема</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SafetyStock</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ИсключитьОтслеживаниеНепродТов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЯчейкиХраненияУдалить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаХранения</Name>
							<Comment>Ячейка хранения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/атКлиент/Ext/Module.bsl
// Определяет пройдена ли авторизации. При необходимости открывает форму авторизации
//
// Возвращаемое значение:
//  ПрошлиАвторизацию - Булево - Признак успешности прохождения авторизаци
//
Функция АвторизацияПройдена(ОткрыватьФормуАвторизации=Истина, Пинг=Ложь, Ошибка="", ЭтаФорма=Неопределено) Экспорт
	
	Если НЕ атСервер.СервисДоступен(Ошибка, Пинг) Тогда
		Если ОткрыватьФормуАвторизации И ЗначениеЗаполнено(Ошибка) Тогда
			Предупреждение(Ошибка);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	СтатусПользователя = ПараметрыСеанса.атКодСостояния%10;
	// Статусы пользователя
	//(0, "Запрещено использование");
	//(1, "Не указан логин");
	//(2, "Сохранен логин");
	//(3, "Авторизован"); // Ок
	//(4, "Отказ от авторизации");
	//(5, "Ошибка авторизации"); // Err
	
	ПрошлиАвторизацию = СтатусПользователя = 3;
	
	Если СтатусПользователя = 2 Тогда
		// Сохранен логин
		
		Логин = атСервер.ПолучитьНастройку(ПараметрыСеанса.Пользователь, "Логин");
		Пароль = атСервер.ПолучитьНастройку(ПараметрыСеанса.Пользователь, "Пароль");
		
		Если ПустаяСтрока(Пароль) Тогда
			АвторизацияУспешна = Ложь;
		Иначе
			АвторизацияУспешна = атСервер.ВыполнитьЗапросАвторизации(Логин, Пароль, Ошибка);
		КонецЕсли;
		
		Если Не АвторизацияУспешна И ОткрыватьФормуАвторизации Тогда
			
			ФормаАвторизации = Обработки.атПомощникПродаж.ПолучитьФорму("АвторизацияПользователя");
			Результат = ФормаАвторизации.ОткрытьМодально();
			
			Если Результат = Истина Тогда
				// Оповещение вызвано в форме авторизации
				ПрошлиАвторизацию = Истина;
			КонецЕсли;
			
		Иначе
			
			Если АвторизацияУспешна Тогда
				ПрошлиАвторизацию = Истина;
				// оповестим формы о результате авторизации
				Оповестить("атПомощникПродаж_Авторизация",, ЭтаФорма);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПрошлиАвторизацию;
	
КонецФункции

Процедура УстановитьСоответствие(СтрокаСловаря, ВыбранноеЗначение, Оповещать = Истина) Экспорт
	
	СтруктураСловаря = Новый Структура("Тип, Код, ВладелецТип, ВладелецКод");
	ЗаполнитьЗначенияСвойств(СтруктураСловаря, СтрокаСловаря);
	
	Если атСервер.СопоставитьСловарюСсылку(СтруктураСловаря, ВыбранноеЗначение) И Оповещать Тогда
		ПараметрыОповещения = Новый Структура("СсылкаСловаря, СсылкаИБ", СтрокаСловаря, ВыбранноеЗначение);
		Оповестить("атПомощникПродаж_УстановленоСоответствие", ПараметрыОповещения);
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураСтрокиЗапроса() Экспорт
	Возврат Новый Структура("Идентификатор,
							|ДатаОбращения,
							|Описание,
							|СервисКод,
							|СервисНаименование,
							|КаталогКод,
							|КаталогНаименование,
							|МодельКод,
							|МодельНаименование,
							|МодификацияКод,
							|МодификацияНаименование,
							|Параметры");
КонецФункции

Функция СтруктураСтрокиНомераДетали() Экспорт
	Возврат Новый Структура("ДатаЗаписи,
							|Идентификатор,
							|ИдентификаторЗапроса,
							|ХешАртикулПроизводитель,
							|Артикул,
							|АртикулДляПоиска,
							|ПроизводительКод,
							|Производитель,
							|НоменклатураКод,
							|Номенклатура,
							|Наименование,
							|Количество,
							|ИмяНабора,
							|Параметры,
							|Комментарий");
КонецФункции

Функция НайтиПроизводителяСтроки(ТекСтрока, Создавать=Ложь) Экспорт
	
	Если ТипЗнч(ТекСтрока.Производитель) = Тип("СправочникСсылка.Производители") Тогда
		Возврат ТекСтрока.Производитель;
	ИначеЕсли ТипЗнч(ТекСтрока.Производитель) = Тип("Структура") Тогда
		ПроизводительСтроки = атСервер.ПолучитьСопоставленнуюСсылку(ТекСтрока.Производитель,, Ложь);
		Если ПроизводительСтроки = Неопределено Тогда
			// Первое обращение к производителю!
			ПроизводительСтроки = атСервер.НайтиСоответствиеЭлементу(ТекСтрока.Производитель);
			Если Не ЗначениеЗаполнено(ПроизводительСтроки) И Создавать Тогда
				ПроизводительСтроки = атСервер.СоздатьОбъектИБ("Производители", ТекСтрока.Производитель);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПроизводительСтроки) Тогда
				атКлиент.УстановитьСоответствие(ТекСтрока.Производитель, ПроизводительСтроки, Истина);
			ИначеЕсли Не Создавать Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		Возврат ПроизводительСтроки;
	КонецЕсли;
	
	Попытка
		ПроизводительКод = ТекСтрока.ПроизводительКод;
	Исключение
		ПроизводительКод = Неопределено;
	КонецПопытки;
	Если ЗначениеЗаполнено(ПроизводительКод) Тогда
		СтруктураСловаря = Новый Структура("ЭтоСсылка, Тип, Код, Наименование", Истина, "Производители", ПроизводительКод, ""+ТекСтрока.Производитель);
		ПроизводительСтроки = атСервер.ПолучитьСопоставленнуюСсылку(СтруктураСловаря,, Ложь);
		Если ПроизводительСтроки = Неопределено Тогда
			// Первое обращение к производителю!
			ПроизводительСтроки = атСервер.НайтиСоответствиеЭлементу(СтруктураСловаря);
			Если Не ЗначениеЗаполнено(ПроизводительСтроки) И Создавать Тогда
				ПроизводительСтроки = атСервер.СоздатьОбъектИБ("Производители", СтруктураСловаря);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПроизводительСтроки) Тогда
				атКлиент.УстановитьСоответствие(СтруктураСловаря, ПроизводительСтроки, Истина);
			ИначеЕсли Не Создавать Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		Возврат ПроизводительСтроки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.Производитель) Тогда
		ПроизводительСтроки = Справочники.Номенклатура.НайтиПроизводителяПоНаименованию(ТекСтрока.Производитель);
		Если ЗначениеЗаполнено(ПроизводительСтроки) Тогда
			Возврат ПроизводительСтроки;
		КонецЕсли;
		Если Создавать Тогда
			// Нужно создать производителя!
			НовыйОбъект = Справочники.Производители.СоздатьЭлемент();
			НовыйОбъект.Заполнить(Неопределено);
			НовыйОбъект.УстановитьНовыйКод();
			НовыйОбъект.Наименование = ТекСтрока.Производитель;
			НовыйОбъект.АртикулыОбязательны = Истина;
			Попытка
				НовыйОбъект.Записать();
				Возврат НовыйОбъект.Ссылка;
			Исключение КонецПопытки;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// Ничего в итоге не нашли и не вернулись!
	Возврат Справочники.Производители.ПустаяСсылка();
	
КонецФункции

Функция СоздатьНоменклатуруСтроки(ТекСтрока, ЭтаФорма, ВыборПользователя=Неопределено) Экспорт 
	
	// Создавать не будем, так как далее пользователь может отказаться от создания номенклатуры
	ПроизводительСтроки = НайтиПроизводителяСтроки(ТекСтрока, Ложь);
	
	Если ПроизводительСтроки <> Неопределено Тогда
		ТекСтрока.Производитель = ПроизводительСтроки;
		// Какой-то производитель есть в строке, попробуем найти номенклатуру
		НоменклатураСтроки = атСервер.НайтиНоменклатуру(ТекСтрока.АртикулДляПоиска, ПроизводительСтроки);
		Если ЗначениеЗаполнено(НоменклатураСтроки) Тогда
			Попытка
				ТекСтрока.Номенклатура = НоменклатураСтроки;
			Исключение КонецПопытки;
			Возврат НоменклатураСтроки;
		КонецЕсли;
	КонецЕсли;
	
	// Можно поискать через Словарь Номенклатура, если в строке есть НоменклатураКод!
	СтруктураСловаряНоменклатура = Неопределено;
	Попытка
		Если ЗначениеЗаполнено(ТекСтрока.НоменклатураКод) Тогда
			СтруктураСловаряНоменклатура = атСервер.ПолучитьОбъект(Новый Структура("ЭтоСсылка, Тип, Код, Наименование", Истина, "Номенклатура", ТекСтрока.НоменклатураКод, ТекСтрока.Номенклатура));
			НоменклатураСтроки = атСервер.НайтиСоответствиеЭлементу(СтруктураСловаряНоменклатура);
			Если ЗначениеЗаполнено(НоменклатураСтроки) Тогда
				ТекСтрока.Номенклатура = НоменклатураСтроки;
				атКлиент.УстановитьСоответствие(СтруктураСловаряНоменклатура, НоменклатураСтроки, Истина);
				Возврат НоменклатураСтроки;
			КонецЕсли;
		КонецЕсли;
	Исключение КонецПопытки;
	
	Если ВыборПользователя = "Отмена" Тогда
		// Те позиции которые нашлись ранее нас устраивают,
		// а дальше мы ничего не будем создавать!
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Справочники.Номенклатура) Тогда
		Предупреждение("Нет прав добавлять новые позиции номенклатуры");
		ВыборПользователя = "Отмена";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВыборПользователя = Неопределено Тогда
		ВариантСоздания = обПраво("АвтоматическоеСозданиеНоменклатурыИзПрайсЛистовКонтрагентов", глПрава);
		Если ВариантСоздания = Перечисления.ВариантыОтветов.Спрашивать Тогда
			Ответ = Вопрос("Создать новый элемент Номенклатуры?
				|<Да> - Открыть форму элемента,
				|<Нет> - Создать автоматически,
				|<Отмена> - Отменить действие.",
				РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				ВыборПользователя = "Отмена";
				Возврат Неопределено;
			КонецЕсли;
			ВыборПользователя = (Ответ = КодВозвратаДиалога.Да);
		ИначеЕсли ВариантСоздания = Перечисления.ВариантыОтветов.Да Тогда
			// Интерактивное создание
			ВыборПользователя = Ложь;
		Иначе
			ВыборПользователя = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИнтерактивноеДобавлениеНоменклатуры = ВыборПользователя;
	
	Если ПроизводительСтроки = Неопределено Тогда
		// Создадим производителя и попробуем найти номенклатуру
		ПроизводительСтроки = НайтиПроизводителяСтроки(ТекСтрока, Истина);
		ТекСтрока.Производитель = ПроизводительСтроки;
		НоменклатураСтроки = атСервер.НайтиНоменклатуру(ТекСтрока.АртикулДляПоиска, ПроизводительСтроки);
		Если ЗначениеЗаполнено(НоменклатураСтроки) Тогда
			Попытка
				ТекСтрока.Номенклатура = НоменклатураСтроки;
			Исключение КонецПопытки;
			Возврат НоменклатураСтроки;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураСловаряНоменклатура <> Неопределено И Не ИнтерактивноеДобавлениеНоменклатуры Тогда
		// Это у нас номенклатура из сервиса, которую нужно создать автоматически
		НоменклатураСтроки = атСервер.СоздатьОбъектИБ("Номенклатура", СтруктураСловаряНоменклатура);
		Попытка
			ТекСтрока.Номенклатура = НоменклатураСтроки;
		Исключение КонецПопытки;
		УстановитьСоответствие(СтруктураСловаряНоменклатура, НоменклатураСтроки, Истина);
		Сообщить("Записан справочник номенклатуры <" + спПолучитьНаименование(НоменклатураСтроки) + ">");
		Оповестить("ЗаписанаНоменклатура", НоменклатураСтроки, ЭтаФорма);
		Возврат НоменклатураСтроки;
	КонецЕсли;
	
	// Ничего не нашлось ранее
	// Осталось только создать новую позицию номенклатуры
	
	НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	НоменклатураОбъект.УстановитьНовыйКод();
	
	НоменклатураОбъект.Артикул          = ТекСтрока.Артикул;
	НоменклатураОбъект.АртикулДляПоиска = ТекСтрока.АртикулДляПоиска;
	НоменклатураОбъект.Производитель    = ПроизводительСтроки;
	
	Попытка
		НоменклатураОбъект.Наименование       = ТекСтрока.Наименование;
		НоменклатураОбъект.НаименованиеПолное = ТекСтрока.Наименование;
	Исключение
		НоменклатураОбъект.Наименование       = ТекСтрока.Номенклатура;
		НоменклатураОбъект.НаименованиеПолное = ТекСтрока.Номенклатура;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(НоменклатураОбъект.Производитель) Тогда
		НоменклатураОбъект.СтранаПроисхождения = НоменклатураОбъект.Производитель.СтранаПроисхождения;
	КонецЕсли;
	
	Попытка
		Если НЕ ПустаяСтрока(ТекСтрока.НаименованиеИностранное) Тогда
			НоменклатураОбъект.НаименованиеИностранное = ТекСтрока.НаименованиеИностранное;
		КонецЕсли;
	Исключение КонецПопытки;
	
	Попытка
		НоменклатураОбъект.Вес = ТекСтрока.Вес;
	Исключение КонецПопытки;
	Попытка
		НоменклатураОбъект.Объем = ТекСтрока.Объем;
	Исключение КонецПопытки;
	
	Попытка
		Если ТипЗнч(ТекСтрока.Размещение) = Тип("СправочникСсылка.ПрайсЛистыКонтрагентов") Тогда
			НоменклатурнаяГруппа = ТекСтрока.Размещение.НоменклатурнаяГруппа;
		КонецЕсли;
	Исключение
		НоменклатурнаяГруппа = атСервер.ПолучитьНастройку("Номенклатура", "НоменклатурнаяГруппа");
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		НоменклатурнаяГруппа = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	НоменклатураОбъект.Родитель        = НоменклатурнаяГруппа;
	НоменклатураОбъект.ПроцентНаценки  = НоменклатураОбъект.Родитель.ПроцентНаценки;
	НоменклатураОбъект.ТипНоменклатуры = ?(обЗначениеНеЗаполнено(НоменклатурнаяГруппа.ТипНоменклатуры), Справочники.ТипыНоменклатуры.Штучный, НоменклатурнаяГруппа.ТипНоменклатуры);
	НоменклатураОбъект.СтавкаНДС       = ?(обЗначениеНеЗаполнено(НоменклатурнаяГруппа.СтавкаНДС), Справочники.СтавкиНДС.ОсновнаяСтавкаНДС, НоменклатурнаяГруппа.СтавкаНДС);
	НоменклатураОбъект.ВалютаУчета     = ?(обЗначениеНеЗаполнено(НоменклатурнаяГруппа.ВалютаУчета), Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), НоменклатурнаяГруппа.ВалютаУчета);
	НоменклатураОбъект.ВидНоменклатуры = ?(обЗначениеНеЗаполнено(НоменклатураОбъект.ТипНоменклатуры.ВидНоменклатуры), Перечисления.ВидыНоменклатуры.Товар, НоменклатураОбъект.ТипНоменклатуры.ВидНоменклатуры);
	НоменклатураОбъект.БазоваяЕдиницаИзмерения = ?(обЗначениеНеЗаполнено(НоменклатураОбъект.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения), Константы.ОсновнаяЕдиницаИзмеренияКоличества.Получить(), НоменклатураОбъект.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения);
	
	//Если флаг взведен, то открываем новую карточку в модальном режиме
	Если ИнтерактивноеДобавлениеНоменклатуры Тогда
		ФормаСправочника = НоменклатураОбъект.ПолучитьФорму(, ЭтаФорма);
		ФормаСправочника.ОткрытьМодально();
	Иначе
		//Если флаг не взведен, то просто сохраняем карточку
		Попытка
			НоменклатураОбъект.Записать();
			Сообщить("Записан справочник номенклатуры <" + спПолучитьНаименование(НоменклатураОбъект) + ">");
			Попытка // Возможна ошибка при записи основной единицы измерения (если не задана базовая)
				НоменклатураОбъект.ОсновнаяЕдиницаИзмерения = НоменклатураОбъект.ПолучитьЕдиницуИзмеренияПоБазовой();
				НоменклатураОбъект.Записать();
			Исключение
				Сообщить("Ошибка записи основной единицы измерения для номенклатуры <" + спПолучитьНаименование(НоменклатураОбъект) + ">");
			КонецПопытки;
		Исключение
			Сообщить("Ошибка записи номенклатуры <"+спПолучитьНаименование(НоменклатураОбъект)+">");
			// Откроем интерактивно, что бы пользователь мог исправить причину исключения
			ФормаСправочника = НоменклатураОбъект.ПолучитьФорму(, ЭтаФорма);
			ФормаСправочника.ОткрытьМодально();
		КонецПопытки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураОбъект.Ссылка) Тогда
		//оповещение источника о записи, чтобы спозиционироваться на добавленной номенклатуре
		Попытка 
			ТекСтрока.Номенклатура = НоменклатураОбъект.Ссылка
		Исключение КонецПопытки;
		Оповестить("ЗаписанаНоменклатура", НоменклатураОбъект.Ссылка, ЭтаФорма);
	КонецЕсли;
	
	Возврат НоменклатураОбъект.Ссылка;
	
КонецФункции //СоздатьНоменклатуруСтроки()
